
#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыТЧ

&НаКлиенте
Процедура ТоварыТЧНоменклатураПриИзменении(Элемент)
	
	
	
	Строка = Элементы.ТоварыТЧ.ТекущиеДанные;
	
	Строка.Количество = 1;
	Строка.Цена = ПолучитьЦену(Строка.Номенклатура, Объект.Дата);
	
	ОбновитьИтоговуюСумму();
	
КонецПроцедуры




&НаКлиенте
Процедура ТоварыТЧКоличествоПриИзменении(Элемент)
	
	Строка = Элементы.ТоварыТЧ.ТекущиеДанные;	
	Строка.Цена = Строка.Цена * Строка.Количество;
	
	ОбновитьИтоговуюСумму();
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИтоговуюСумму()
	
	Объект.ИтоговаяСумма = Объект.ТоварыТЧ.Итог("Цена");
	
КонецПроцедуры


&НаСервере
Функция ПолучитьЦену(Номенклатура, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК
	|		ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Сообщить("У данного товара нет цены!");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Выборка.Цена;
КонецФункции
#КонецОбласти

