
#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыТЧ

&НаКлиенте
Процедура ТоварыТЧНоменклатураПриИзменении(Элемент)
	
	
	
	Строка = Элементы.ТоварыТЧ.ТекущиеДанные;
	
	Строка.Количество = 1;
	Строка.Цена = ПолучитьЦену(Строка.Номенклатура, Объект.Дата);
	
	ОбновитьИтоговуюСумму();
	
КонецПроцедуры




&НаКлиенте
Процедура ТоварыТЧКоличествоПриИзменении(Элемент)
	
	Строка = Элементы.ТоварыТЧ.ТекущиеДанные;	
	Строка.Цена = Строка.Цена * Строка.Количество;
	
	ОбновитьИтоговуюСумму();
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьИтоговуюСумму()
	
	Объект.ИтоговаяСумма = Объект.ТоварыТЧ.Итог("Цена");
	
КонецПроцедуры


&НаСервере
Функция ПолучитьЦену(Номенклатура, Период)
	
	Возврат РегистрыСведений.ЦеныНоменклатуры.ЦеныНоменклатуры(Номенклатура, Период);

КонецФункции
#КонецОбласти

