
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьКлиентов(Команда)
	ДобавитьКлиентовНаСервере();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.Клиенты"));
КонецПроцедуры

&НаСервере
Процедура ДобавитьКлиентовНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ДобавитьКлиентов(Элементы.ЧислоДобавляемыхКлиентов); // Как отправить число а не поле формы
	
КонецПроцедуры



&НаКлиенте
Процедура УдалитьВсехКлиентов(Команда)
	УдалитьВсехКлиентовНаСервере();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.Клиенты"));
КонецПроцедуры

&НаСервере
Процедура УдалитьВсехКлиентовНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.УдалитьВсехКлиентов();
	
КонецПроцедуры
#КонецОбласти
