
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипДобавления = "Клиент";
	ТипУдаления = "Клиент";
	
	ИзменитьЗаголовокДобавления();
	ИзменитьЗаголовокУдаления();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДобавленияПриИзменении(Элемент)
	
	ИзменитьЗаголовокДобавления();
	
КонецПроцедуры


&НаКлиенте
Процедура ТипУдаленияПриИзменении(Элемент)
	
	ИзменитьЗаголовокУдаления();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСущности(Команда)
	
	
	ЧислоДобавляемых = Объект.ЧислоДобавляемыхОбъектов;
	
	Если ЧислоДобавляемых > 100 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "ЧислоДобавляемыхОбъектов";
		Сообщение.Текст = "Не больше 100!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	СущностьДляДобавления = ТипДобавления;
	
	Если СущностьДляДобавления = "Клиент" Тогда
		ДобавитьКлиентовНаСервере(ЧислоДобавляемых);	
		ОповеститьОбИзменении(Тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	Если СущностьДляДобавления = "Сотрудник" Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Добавление сотрудника";
		Сообщение.Сообщить();
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура Продать(Команда)
	ЧислоПродаж = Объект.ЧислоДокументовПродажи;
	
	Если ЧислоПродаж > 100 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "ЧислоДокументовПродажи";
		Сообщение.Текст = "Не больше 100!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПродатьНаСервере(ЧислоПродаж);	
	ОповеститьОбИзменении(Тип("ДокументСсылка.Продажа"));
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеСущности(Команда)
	
	СущностьДляУдаления = ТипУдаления;
	
	Если СущностьДляУдаления = "Клиент" Тогда
		
		УдалитьВсехКлиентовНаСервере();
	
		ОповеститьОбИзменении(Тип("СправочникСсылка.Клиенты"));
		
	КонецЕсли;
	
	Если СущностьДляУдаления = "Сотрудник" Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Удаление сотрудника";
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеПродажи(Команда)
	УдалитьВсеПродажиНаСервере();
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.Продажа"));
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьЗаголовокДобавления()
	
	Если ТипДобавления = "Клиент" Тогда
		Элементы.ЧислоДобавляемыхОбъектов.Заголовок = "Число добавляемых клиентов: ";
	Иначе Если ТипДобавления = "Сотрудник" Тогда
			Элементы.ЧислоДобавляемыхОбъектов.Заголовок = "Число добавляемых сотрудников: ";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗаголовокУдаления()
	
	Если ТипУдаления = "Клиент" Тогда
		Элементы.УдалитьВсеСущности.Заголовок = "Удалить всех клиентов";
	Иначе Если ТипУдаления = "Сотрудник" Тогда
			Элементы.УдалитьВсеСущности.Заголовок = "Удалить всех сотрудников";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКлиентовНаСервере(ЧислоДобавляемых)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ДобавитьКлиентов(ЧислоДобавляемых); // Как отправить число а не поле формы
	
КонецПроцедуры
	
&НаСервере
Процедура ПродатьНаСервере(ЧислоПродаж)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОформитьДокументыПродажи(ЧислоПродаж);

	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсехКлиентовНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.УдалитьВсехКлиентов();
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеПродажиНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.УдалитьВсеПродажи();
	
КонецПроцедуры

#КонецОбласти