
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьКлиентов(Команда)
	
	ЧислоДобавляемых = Объект.ЧислоДобавляемыхКлиентов;
	
	Если ЧислоДобавляемых > 100 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "ЧислоДобавляемыхКлиентов";
		Сообщение.Текст = "Не больше 100!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ДобавитьКлиентовНаСервере(ЧислоДобавляемых);	
	ОповеститьОбИзменении(Тип("СправочникСсылка.Клиенты"));
КонецПроцедуры

&НаСервере
Процедура ДобавитьКлиентовНаСервере(ЧислоДобавляемых)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ДобавитьКлиентов(ЧислоДобавляемых); // Как отправить число а не поле формы
	
КонецПроцедуры





&НаКлиенте
Процедура Продать(Команда)
	ЧислоПродаж = Объект.ЧислоДокументовПродажи;
	
	Если ЧислоПродаж > 100 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "ЧислоДокументовПродажи";
		Сообщение.Текст = "Не больше 100!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПродатьНаСервере(ЧислоПродаж);	
	ОповеститьОбИзменении(Тип("ДокументСсылка.Продажа"));
КонецПроцедуры

&НаСервере
Процедура ПродатьНаСервере(ЧислоПродаж)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОформитьДокументыПродажи(ЧислоПродаж);

	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсехКлиентов(Команда)
	УдалитьВсехКлиентовНаСервере();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.Клиенты"));
КонецПроцедуры

&НаСервере
Процедура УдалитьВсехКлиентовНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.УдалитьВсехКлиентов();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеПродажи(Команда)
	УдалитьВсеПродажиНаСервере();
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.Продажа"));
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеПродажиНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.УдалитьВсеПродажи();
	
КонецПроцедуры
#КонецОбласти
