Процедура ДобавитьКлиентов() Экспорт
	// Прочитать всех клиентов из файла в массив
	// Случайным образом выбрать элемент массива
	// Проверить, есть ли такой клиент уже в базе
	// Записать
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(1, 500);
	СлучайныйКлиентФИО = ПолучитьМакет("СлучайныеФИО").ПолучитьСтроку(СлучайноеЧисло);
	
	Если Не КлиентСуществует(СлучайныйКлиентФИО) Тогда
		ДобавитьКлиента(СлучайныйКлиентФИО);
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("Клиент с такими ФИО уже есть в базе: %1", СлучайныйКлиентФИО);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьВсехКлиентов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Клиенты.Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Клиент = Выборка.Ссылка.ПолучитьОбъект();
		Клиент.Удалить();
	
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ДобавитьКлиента(ФИО)
	
	НовыйКлиент = Справочники.Клиенты.СоздатьЭлемент();
	НовыйКлиент.Наименование = ФИО;
	НовыйКлиент.Записать();
	
КонецПроцедуры

Функция КлиентСуществует(ФИО)
	
	ВозможныйКлиент = Справочники.Клиенты.НайтиПоНаименованию(ФИО);
	
	Если ВозможныйКлиент.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции